{
  "products": [
    {
      "id": "A-01",
      "name": "Biometric Gun Safe for Pistols",
      "category": "Tech",
      "description": "BILLCONCH Biometric Gun Safe\nInstant fingerprint access. Military-grade protection.\n⚡ Unlock in seconds with biometric tech, PIN, or backup key\n🔒 Hard carbon steel — built like a bank vault\n💡 LED interior lighting for instant visibility\n🚗 Fits bedside, nightstand, closet, or car",
      "imageUrl": "https://m.media-amazon.com/images/I/81R2ISmL3vL._AC_SL1500_.jpg",
      "affiliateUrl": "https://amzn.to/4aT3OOK",
      "features": [
        "Lock Type    Biometric, Electronic Combination Lock",
        "Additional Features    Portable",
        "Mounting Type    Freestanding, Tabletop",
        "Control Type    Key Control",
        "Water Resistance Level    Not Water Resistant"
      ]
    },
    {
      "id": "A-02",
      "name": "R.W.FLAME 68 inch Recessed and Wall Mounted Electric Fireplace",
      "category": "Heater",
      "description": "Transform any room into a cozy retreat with this sleek 68-inch electric fireplace insert. The ultra-slim design (only 3.86\" deep) fits seamlessly into your space while delivering powerful zone heating up to 400 square feet. Choose from 12 stunning flame colors and customize brightness to match your mood. ETL safety certified with overheat protection and natural humidity preservation - no dry air discomfort. Energy-efficient dual heating modes (750W/1500W) let you stay warm without breaking the bank. Perfect for living rooms, bedrooms, or offices. Installation is simple, operation is effortless with both touchscreen and remote control.",
      "imageUrl": "https://m.media-amazon.com/images/I/51kuaq1BEeL._AC_SL1172_.jpg",
      "affiliateUrl": "https://amzn.to/4sL1GPG",
      "features": [
        "USB-C Connection",
        "Gain Control",
        "Built-in Pop Filter",
        "Mute Button"
      ]
    },
    {
      "id": "A-03",
      "name": "LUXE Bidet NEO 120 ",
      "category": "Bathroom",
      "description": "Upgrade your bathroom with premium comfort and sustainability. This sleek bidet attachment features high-pressure valves with metal-ceramic cores, durable steel hoses, and self-retracting nozzles with hygienic guard gate protection. Installs in minutes on any standard two-piece toilet with all tools included. Save money on toilet paper, reduce environmental impact, and enjoy a gentler, cleaner experience every day.",
      "imageUrl": "https://m.media-amazon.com/images/I/61+niaxtE4L._AC_SL1500_.jpg",
      "affiliateUrl": "https://amzn.to/4pFLQTs",
      "features": [
        "Retractable nozzles, protective guard gate, and built to fit most toilet setups.",
        "Slide-in Installation, Advanced 360° Self-Clean Mode, and Lift-to-Clean Hinges.",
        "Doft-close, quick-release, and designed to fit any bidet attachment."
      ]
    },
    {
      "id": "A-04",
      "name": "Moen Flo Smart Water Monitor and Automatic Shutoff Sensor, Wi-Fi Connected Water Leak Detector for 1-Inch Diameter Pipe, 900-006",
      "category": "Utility",
      "description": "Protect your home from burst pipes and costly water damage with the Moen Smart Water Shutoff system. This intelligent device automatically detects leaks and shuts off your water supply before disaster strikes—especially critical during winter when frozen pipes are most vulnerable. Get instant alerts on your phone and control your water from anywhere. Professional installation recommended for 1" to 1-1/4" pipes.",
      "imageUrl": "https://m.media-amazon.com/images/I/61oF2ls8ZJL._AC_SL1500_.jpg",
      "affiliateUrl": "https://amzn.to/49nZFBj",
      "features": [
        "Power Source AC",
        "Compatible Devices Smartphone, Tablet",
        "Battery Description requires ac power",
        "Number of Batteries 1 AA batteries required.",
        "Voltage 12 Volts",
        "Control Method Voice",
        "Mounting Type Wall Mount",
        "Sensor Technology Flow Sensor"
      ]
    }
  ]
}